# Amostragem

In [1]:
import pandas as pd
import numpy as np
import random

from sklearn.model_selection import StratifiedShuffleSplit

In [2]:
base_census = pd.read_csv('Bases de dados/census.csv')
print(base_census.shape)
base_census.head()

(32561, 15)

,age,workclass,final-weight,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loos,hour-per-week,native-country,income
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [3]:
print(base_census.info())
base_census.describe(include='all').T

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32561 entries, 0 to 32560
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             32561 non-null  int64
 1   workclass       32561 non-null  object
 2   final-weight    32561 non-null  int64
 3   education       32561 non-null  object
 4   education-num   32561 non-null  int64
 5   marital-status  32561 non-null  object
 6   occupation      32561 non-null  object
 7   relationship    32561 non-null  object
 8   race            32561 non-null  object
 9   sex             32561 non-null  object
 10  capital-gain    32561 non-null  int64
 11  capital-loos    32561 non-null  int64
 12  hour-per-week   32561 non-null  int64
 13  native-country  32561 non-null  object
 14  income          32561 non-null  object
dtypes: int64(6), object(9)
memory usage: 3.7+ MB
None

,count,unique,top,freq,mean,std,min,25%,50%,75%,max
age,32561,NaN,NaN,NaN,38.5816,13.6404,17,28,37,48,90
workclass,32561,9,Private,22696,NaN,NaN,NaN,NaN,NaN,NaN,NaN
final-weight,32561,NaN,NaN,NaN,189778,105550,12285,117827,178356,237051,1.48470e+06
education,32561,16,HS-grad,10501,NaN,NaN,NaN,NaN,NaN,NaN,NaN
education-num,32561,NaN,NaN,NaN,10.0807,2.57272,1,9,10,12,16
marital-status,32561,7,Married-civ-spouse,14976,NaN,NaN,NaN,NaN,NaN,NaN,NaN
occupation,32561,15,Prof-specialty,4140,NaN,NaN,NaN,NaN,NaN,NaN,NaN
relationship,32561,6,Husband,13193,NaN,NaN,NaN,NaN,NaN,NaN,NaN
race,32561,5,White,27816,NaN,NaN,NaN,NaN,NaN,NaN,NaN
sex,32561,2,Male,21790,NaN,NaN,NaN,NaN,NaN,NaN,NaN
capital-gain,32561,NaN,NaN,NaN,1077.65,7385.29,0,0,0,0,99999
capital-loos,32561,NaN,NaN,NaN,87.3038,402.96,0,0,0,0,4356
hour-per-week,32561,NaN,NaN,NaN,40.4375,12.3474,1,40,40,45,99
native-country,32561,42,United-States,29170,NaN,NaN,NaN,NaN,NaN,NaN,NaN
income,32561,2,<=50K,24720,NaN,NaN,NaN,NaN,NaN,NaN,NaN

## Amostragem aleatória simples

In [4]:
df_amostra_aleat_simples = base_census.sample(n=100, replace=False, random_state=1)  # replace permite que o mesmo registro nao seja selecionado mais de uma vez (já pe dado como False)
print(df_amostra_aleat_simples.shape)   # 100 registros completos da base
#list(df_amostra_aleat_simples.index)

(100, 15)

In [5]:
def amostragem_aleat_simples(dataset, amostras):
    return dataset.sample(n=amostras)

In [6]:
df_amostragem_aleat_simples = amostragem_aleat_simples(base_census, 2)
df_amostragem_aleat_simples

,age,workclass,final-weight,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loos,hour-per-week,native-country,income
16493,23,Private,42706,Some-college,10,Never-married,Prof-specialty,Not-in-family,White,Male,0,0,45,United-States,<=50K
6950,38,Private,107630,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,40,United-States,<=50K

## Amostragem sistemática

In [7]:
base_census.shape

(32561, 15)

In [8]:
# amostra de 100 pessoas
len(base_census) // 100

# selecionar um número aleatório entre 0 e 325
# o próximo será do número escolhido até o numero + 325

325

In [9]:
random.seed(1)  # retornar sempre o mesmo
random.randint(0, 325)

68

In [10]:
print(68 + 325)
random.seed(1)  
random.randint(68, 68+325)

393

136

Com a biblioteca numpy:

In [11]:
np.arange(68, len(base_census), step=325)  # retorna 100 numeros

array([   68,   393,   718,  1043,  1368,  1693,  2018,  2343,  2668,
        2993,  3318,  3643,  3968,  4293,  4618,  4943,  5268,  5593,
        5918,  6243,  6568,  6893,  7218,  7543,  7868,  8193,  8518,
        8843,  9168,  9493,  9818, 10143, 10468, 10793, 11118, 11443,
       11768, 12093, 12418, 12743, 13068, 13393, 13718, 14043, 14368,
       14693, 15018, 15343, 15668, 15993, 16318, 16643, 16968, 17293,
       17618, 17943, 18268, 18593, 18918, 19243, 19568, 19893, 20218,
       20543, 20868, 21193, 21518, 21843, 22168, 22493, 22818, 23143,
       23468, 23793, 24118, 24443, 24768, 25093, 25418, 25743, 26068,
       26393, 26718, 27043, 27368, 27693, 28018, 28343, 28668, 28993,
       29318, 29643, 29968, 30293, 30618, 30943, 31268, 31593, 31918,
       32243])

In [12]:
def amostragem_sistematica(dataset, amostras):
    intervalo = len(dataset) // amostras
    random.seed(1)
    inicio = random.randint(0, intervalo)
    indices = np.arange(inicio, len(dataset), step=intervalo)
    amostra_sist = dataset.iloc[indices]
    return amostra_sist

In [13]:
df_amostragem_sistematica = amostragem_sistematica(base_census, 100)
df_amostragem_sistematica.shape

(100, 15)

## Amostragem por Grupos

Define-se um numero de grupos e pega-se registros de cada grupo (aleatoriamente)

In [14]:
len(base_census) / 10  # numero de pessoas por grupo

3256.1

In [15]:
grupos = []
id_grupo = 0
contagem = 0

for _ in base_census.iterrows():
    grupos.append(id_grupo)
    contagem +=1
    if contagem > (len(base_census) // 10):
        contagem = 0
        id_grupo +=1

In [16]:
len(grupos)  # para cada registro

32561

In [17]:
np.unique(grupos, return_counts=True)

(array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9]),
 array([3257, 3257, 3257, 3257, 3257, 3257, 3257, 3257, 3257, 3248],
       dtype=int64))

In [18]:
base_census['grupo'] = grupos
base_census.head()

,age,workclass,final-weight,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loos,hour-per-week,native-country,income,grupo
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K,0
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K,0
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K,0
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K,0
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K,0

In [19]:
random.randint(0, 9)  # escolhendo o grupo

9

In [20]:
df_agrupamento = base_census[base_census['grupo']==1]
df_agrupamento.shape

(3257, 16)

In [21]:
def amostragem_agrup(dataset, numero_grupos):
    intervalo = len(dataset) / numero_grupos
    grupos = []
    id_grupo = 0
    contagem = 0

    for _ in dataset.iterrows():
        grupos.append(id_grupo)
        contagem +=1
        if contagem > intervalo:
            contagem = 0
            id_grupo +=1
    
    dataset['grupo'] = grupos
    random.seed(1)
    grupo_selecionado = random.randint(0, numero_grupos)
    return dataset[dataset['grupo'] == grupo_selecionado]

In [22]:
df_amostragem_agrup = amostragem_agrup(base_census, 100)
df_amostragem_agrup.shape

(326, 16)

In [23]:
df_amostragem_agrup['grupo'].value_counts()

17    326
Name: grupo, dtype: int64

## Amostragem estratificada

In [24]:
base_census['income'].value_counts(normalize=True)

 <=50K    0.75919
 >50K     0.24081
Name: income, dtype: float64

In [25]:
split = StratifiedShuffleSplit(test_size=0.1)
for x, y in split.split(base_census, base_census['income']):
    df_x = base_census.iloc[x]
    df_y = base_census.iloc[y]

In [26]:
df_x.shape, df_y.shape # 90% e 10% da base de dados

((29304, 16), (3257, 16))

In [27]:
df_x['income'].value_counts(normalize=True)

 <=50K    0.75918
 >50K     0.24082
Name: income, dtype: float64

In [28]:
def amostragem_estratificada(dataset, percentual: float, classe: str):
    split = StratifiedShuffleSplit(test_size=percentual, random_state=1)
    
    for _, y in split.split(dataset, dataset[classe]):
        df_y = dataset.iloc[y]
        
    return df_y

In [29]:
df_amostragem_estratificada = amostragem_estratificada(base_census, 0.1, 'income')
df_amostragem_estratificada.shape

(3257, 16)

## Amostragem de reservatório

- Data stream
- Teste validado

In [30]:
stream = [i for i in range(len(base_census))]
    
#print(stream)

In [31]:
def amostragem_reservatorio(dataset, amostras):
    stream = [i for i in range(len(dataset))]
    tamanho = len(dataset)
    i = 0
    
    reservatorio = [0] * amostras
    for i in range(amostras):
        reservatorio[i] = stream[i]
    
    while i < tamanho:
        j = random.randrange(i+1)
        if j < amostras:
            reservatorio[j] = stream[i]
        i +=1
        
    return dataset.iloc[reservatorio]

In [32]:
df_amostragem_reservatorio = amostragem_reservatorio(base_census, 100)
print(df_amostragem_reservatorio.shape)
df_amostragem_reservatorio.head()

(100, 16)

,age,workclass,final-weight,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loos,hour-per-week,native-country,income,grupo
29608,41,Self-emp-inc,114580,Prof-school,15,Married-civ-spouse,Exec-managerial,Wife,White,Female,0,2415,55,United-States,>50K,90
21696,37,Federal-gov,329088,HS-grad,9,Married-civ-spouse,Adm-clerical,Husband,Black,Male,0,0,40,United-States,<=50K,66
30676,42,Private,355728,Assoc-voc,11,Never-married,Craft-repair,Not-in-family,White,Male,0,0,44,United-States,<=50K,94
28550,43,Private,110970,Bachelors,13,Married-civ-spouse,Prof-specialty,Husband,White,Male,0,1902,40,United-States,>50K,87
8768,52,Federal-gov,221532,Bachelors,13,Married-civ-spouse,Protective-serv,Husband,White,Male,0,0,45,United-States,>50K,26

## Comparativo

In [33]:
base_census['age'].mean()

38.58164675532078

In [34]:
df_amostragem_aleat_simples['age'].mean()

30.5

In [35]:
df_amostragem_sistematica['age'].mean()

37.57

In [36]:
df_amostragem_agrup['age'].mean()

39.23312883435583

In [37]:
df_amostragem_estratificada['age'].mean()

38.58213079521032

In [38]:
df_amostragem_reservatorio['age'].mean()

37.85

A amostragem estratificada foi a única que deu o mesmo valor!

## EXERCICIO

In [40]:
print(base_census.shape)
base_census.head()

(32561, 16)

,age,workclass,final-weight,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loos,hour-per-week,native-country,income,grupo
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K,0
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K,0
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K,0
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K,0
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K,0

In [39]:
base_credito = pd.read_csv('Bases de dados/credit_data.csv')
print(base_credito.shape)
base_credito.head()

(2000, 5)

   i#clientid        income        age         loan  c#default
0           1  66155.925095  59.017015  8106.532131          0
1           2  34415.153966  48.117153  6564.745018          0
2           3  57317.170063  63.108049  8020.953296          0
3           4  42709.534201  45.751972  6103.642260          0
4           5  66952.688845  18.584336  8770.099235          1

In [41]:
df_amostragem_aleat_simples = amostragem_aleat_simples(base_credito, 1000)
df_amostragem_aleat_simples

      i#clientid        income        age         loan  c#default
1240        1241  42591.595235  45.116560  4602.245841          0
746          747  45622.290710  41.632545   528.181250          0
1131        1132  40069.338381  43.313462  3646.051618          0
1850        1851  36431.161412  46.452797  6783.361363          0
1367        1368  46801.274286  34.605221  5315.973820          0
...          ...           ...        ...          ...        ...
362          363  47316.701377  27.064198  1940.674044          0
1836        1837  35914.609306  60.805091   520.996033          0
711          712  29163.015883  43.956171  1469.129704          0
1762        1763  61632.282711  34.430809  3028.591328          0
384          385  29670.671844  53.550200  2928.984088          0

[1000 rows x 5 columns]

In [42]:
df_amostragem_sistematica = amostragem_sistematica(base_credito, 1000)
df_amostragem_sistematica

      i#clientid        income        age         loan  c#default
0              1  66155.925095  59.017015  8106.532131          0
2              3  57317.170063  63.108049  8020.953296          0
4              5  66952.688845  18.584336  8770.099235          1
6              7  48430.359613  26.809132  5722.581981          0
8              9  40654.892537  55.496853  4755.825280          0
...          ...           ...        ...          ...        ...
1990        1991  34237.575419  34.101654  2658.090632          0
1992        1993  30803.806165  23.250084   623.024153          0
1994        1995  24254.700791  37.751622  2225.284643          0
1996        1997  69516.127573  23.162104  3503.176156          0
1998        1999  43756.056605  63.971796  1622.722598          0

[1000 rows x 5 columns]

In [43]:
df_amostragem_agrup = amostragem_agrup(base_credito, 1000)
df_amostragem_agrup

     i#clientid        income        age         loan  c#default  grupo
411         412  52934.594434  50.402982  3248.627718          0    137
412         413  43509.757756  18.075336  7363.037639          1    137
413         414  22118.357329  63.015947  3928.121846          0    137

In [47]:
df_amostragem_estratificada = amostragem_estratificada(base_credito, 1000, 'c#default')
df_amostragem_estratificada

      i#clientid        income        age         loan  c#default  grupo
1374        1375  35916.704154  53.540443  6401.189486          0    458
253          254  25259.401631  39.739766  4341.008082          0     84
1149        1150  56317.082820  24.653482  8045.440953          1    383
1453        1454  28630.009508  27.291530  4406.995056          1    484
1929        1930  27514.088473  36.278684   192.144611          0    643
...          ...           ...        ...          ...        ...    ...
359          360  47904.341242  40.039270  6183.514146          0    119
496          497  59998.253272  54.308927  4659.535976          0    165
864          865  21856.233529  47.722768  1500.653745          0    288
1118        1119  20897.426694  28.029320  2940.423970          1    372
1254        1255  44743.551633  53.056262  2574.707756          0    418

[1000 rows x 6 columns]

In [46]:
df_amostragem_reservatorio = amostragem_reservatorio(base_credito, 1000)
df_amostragem_reservatorio

      i#clientid        income        age         loan  c#default  grupo
0              1  66155.925095  59.017015  8106.532131          0      0
1649        1650  62219.037539  19.523983  5831.521429          0    549
2              3  57317.170063  63.108049  8020.953296          0      0
1114        1115  37887.549393  24.415726  5061.777831          1    371
1023        1024  68414.120777  51.046781  6154.052457          0    341
...          ...           ...        ...          ...        ...    ...
1476        1477  46024.144562  24.174516  4318.377722          0    492
996          997  49104.768240  35.538517  9452.217947          0    332
997          998  65776.232413  39.798191  2805.863745          0    332
998          999  36192.149452  21.402403  7236.173930          1    332
1573        1574  68503.205890  19.280535  3580.463677          0    524

[1000 rows x 6 columns]

## Comparativo

In [49]:
base_credito['age'].mean(), base_credito['income'].mean(), base_credito['loan'].mean()

(40.80755937840458, 45331.60001779331, 4444.369694688262)

In [50]:
df_amostragem_aleat_simples['age'].mean(), df_amostragem_aleat_simples['income'].mean(), df_amostragem_aleat_simples['loan'].mean()

(40.61266261407382, 44959.13813239897, 4380.608661998978)

In [51]:
df_amostragem_sistematica['age'].mean(), df_amostragem_sistematica['income'].mean(), df_amostragem_sistematica['loan'].mean()

(40.91117381141754, 45691.498750669496, 4506.787976426329)

In [52]:
df_amostragem_agrup['age'].mean(), df_amostragem_agrup['income'].mean(), df_amostragem_agrup['loan'].mean()

(43.83142139948904, 39520.903173058, 4846.595734472186)

In [53]:
df_amostragem_estratificada['age'].mean(), df_amostragem_estratificada['income'].mean(), df_amostragem_estratificada['loan'].mean()

(40.53363707173919, 45101.36675026739, 4423.744651094196)

In [54]:
df_amostragem_reservatorio['age'].mean(), df_amostragem_reservatorio['income'].mean(), df_amostragem_reservatorio['loan'].mean()

(40.57203708208336, 45111.19429734541, 4429.634971370371)